char_map = {
    # A variants
    "à": "a", "á": "a", "â": "a", "ä": "a", "ã": "a", "å": "a", "ā": "a", "ą": "a", "ă": "a", "ȧ": "a", "ạ": "a", "ả": "a", "ấ": "a", "ầ": "a", "ẩ": "a", "ẫ": "a", "ậ": "a", "ắ": "a", "ằ": "a", "ẳ": "a", "ẵ": "a", "ặ": "a",
    "À": "A", "Á": "A", "Â": "A", "Ä": "A", "Ã": "A", "Å": "A", "Ā": "A", "Ą": "A", "Ă": "A", "Ȧ": "A", "Ạ": "A", "Ả": "A", "Ấ": "A", "Ầ": "A", "Ẩ": "A", "Ẫ": "A", "Ậ": "A", "Ắ": "A", "Ằ": "A", "Ẳ": "A", "Ẵ": "A", "Ặ": "A",

    # B variants
    "ḃ": "b", "Ḃ": "B",

    # C variants
    "ç": "c", "ć": "c", "ĉ": "c", "ċ": "c", "č": "c",
    "Ç": "C", "Ć": "C", "Ĉ": "C", "Ċ": "C", "Č": "C",

    # D variants
    "ď": "d", "ḋ": "d", "Ḍ": "D", "Ḏ": "D", "Đ": "D",
    "Ď": "D", "ḍ": "d", "đ": "d",

    # E variants
    "è": "e", "é": "e", "ê": "e", "ë": "e", "ē": "e", "ę": "e", "ě": "e", "ĕ": "e", "ė": "e", "ẹ": "e", "ẻ": "e", "ế": "e", "ề": "e", "ể": "e", "ễ": "e", "ệ": "e",
    "È": "E", "É": "E", "Ê": "E", "Ë": "E", "Ē": "E", "Ę": "E", "Ě": "E", "Ĕ": "E", "Ė": "E", "Ẹ": "E", "Ẻ": "E", "Ế": "E", "Ề": "E", "Ể": "E", "Ễ": "E", "Ệ": "E",

    # F variants
    "ḟ": "f", "Ḟ": "F",

    # G variants
    "ĝ": "g", "ğ": "g", "ġ": "g", "ģ": "g", "Ĝ": "G", "Ğ": "G", "Ġ": "G", "Ģ": "G",

    # H variants
    "ĥ": "h", "ḣ": "h", "ḥ": "h", "Ḩ": "H", "Ḥ": "H", "Ĥ": "H", "Ḧ": "H",

    # I variants
    "ì": "i", "í": "i", "î": "i", "ï": "i", "ī": "i", "ĩ": "i", "į": "i", "ı": "i", "ị": "i", "ỉ": "i", "ị̂": "i",
    "Ì": "I", "Í": "I", "Î": "I", "Ï": "I", "Ī": "I", "Ĩ": "I", "Į": "I", "İ": "I", "Ị": "I", "Ỉ": "I",

    # J variants
    "ĵ": "j", "Ĵ": "J",

    # K variants
    "ķ": "k", "ḳ": "k", "Ķ": "K", "Ḳ": "K", "Ḵ": "K",

    # L variants
    "ĺ": "l", "ļ": "l", "ľ": "l", "ḷ": "l", "Ł": "L", "ł": "l", "Ĺ": "L", "Ļ": "L", "Ľ": "L", "Ḷ": "L",

    # M variants
    "ḿ": "m", "ṁ": "m", "Ṃ": "M", "Ḿ": "M",

    # N variants
    "ñ": "n", "ń": "n", "ņ": "n", "ň": "n", "ṅ": "n", "ŉ": "n",
    "Ñ": "N", "Ń": "N", "Ņ": "N", "Ň": "N", "Ṅ": "N",

    # O variants
    "ò": "o", "ó": "o", "ô": "o", "ö": "o", "õ": "o", "ø": "o", "ō": "o", "ő": "o", "ŏ": "o", "ơ": "o", "ọ": "o", "ỏ": "o", "ố": "o", "ồ": "o", "ổ": "o", "ỗ": "o", "ộ": "o", "ớ": "o", "ờ": "o", "ở": "o", "ỡ": "o", "ợ": "o",
    "Ò": "O", "Ó": "O", "Ô": "O", "Ö": "O", "Õ": "O", "Ø": "O", "Ō": "O", "Ő": "O", "Ŏ": "O", "Ơ": "O", "Ọ": "O", "Ỏ": "O", "Ố": "O", "Ồ": "O", "Ổ": "O", "Ỗ": "O", "Ộ": "O", "Ớ": "O", "Ờ": "O", "Ở": "O", "Ỡ": "O", "Ợ": "O",

    # P variants
    "ṕ": "p", "Ṗ": "P",

    # Q variants
    "q̇": "q", "Q̇": "Q",

    # R variants
    "ŕ": "r", "ŗ": "r", "ř": "r", "ṙ": "r", "Ṛ": "R", "Ṙ": "R", "Ŕ": "R", "Ŗ": "R", "Ř": "R",

    # S variants
    "ś": "s", "ŝ": "s", "ş": "s", "š": "s", "ṣ": "s", "ṡ": "s",
    "Ś": "S", "Ŝ": "S", "Ş": "S", "Š": "S", "Ṣ": "S", "Ṡ": "S",

    # T variants
    "ţ": "t", "ť": "t", "ṭ": "t", "ṫ": "t", "Ṭ": "T", "Ṱ": "T", "Ţ": "T", "Ť": "T",

    # U variants
    "ù": "u", "ú": "u", "û": "u", "ü": "u", "ũ": "u", "ū": "u", "ų": "u", "ŭ": "u", "ů": "u", "ư": "u", "ụ": "u", "ủ": "u", "ứ": "u", "ừ": "u", "ử": "u", "ữ": "u", "ự": "u",
    "Ù": "U", "Ú": "U", "Û": "U", "Ü": "U", "Ũ": "U", "Ū": "U", "Ų": "U", "Ŭ": "U", "Ů": "U", "Ư": "U", "Ụ": "U", "Ủ": "U", "Ứ": "U", "Ừ": "U", "Ử": "U", "Ữ": "U", "Ự": "U",

    # V variants
    "ṿ": "v", "Ṿ": "V",

    # W variants
    "ẃ": "w", "ẁ": "w", "ŵ": "w", "ẇ": "w", "ẅ": "w",
    "Ẃ": "W", "Ẁ": "W", "Ŵ": "W", "Ẇ": "W", "Ẅ": "W",

    # X variants
    "ẋ": "x", "Ẍ": "X", "Ẋ": "X",

    # Y variants
    "ý": "y", "ÿ": "y", "ŷ": "y", "ỳ": "y", "ỵ": "y", "ỷ": "y", "ỹ": "y",
    "Ý": "Y", "Ÿ": "Y", "Ŷ": "Y", "Ỳ": "Y", "Ỵ": "Y", "Ỷ": "Y", "Ỹ": "Y",

    # Z variants
    "ź": "z", "ż": "z", "ž": "z", "ẓ": "z", "Ẓ": "Z", "Ź": "Z", "Ż": "Z", "Ž": "Z",
}

def transliterate(input):
    return "".join(char_map.get(c, c) for c in input)


#Test Cases
print(transliterate("Crème Brûlée"))